# Dropping Entries from an Axis

<b>Drop</b> method will return a new object with the indicated value or values deleted from the axis.

#### Series

In [1]:
import pandas as pd
import numpy as np

In [5]:
obj = pd.Series(np.arange(6))
obj

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [8]:
new_obj = obj.drop(4)
new_obj

0    0
1    1
2    2
3    3
5    5
dtype: int64

In [9]:
obj.drop([1,2,3])

0    0
4    4
5    5
dtype: int64

#### DataFrame
With a DF, index values can be deleted from either axis. One must specifiy however axis=1 or axis='columns' if you want to delete from it.

In [11]:
df = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'],
                    columns = ['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
df.drop('Utah')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [14]:
df.drop('one', axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

#### in-place can be used as an argument in drop but becareful as this destroys any data that is dropped as it doesnt return a new object, it just manipulates the current object